{
    "ArduSubgroupsIllochu": {
        "type": "article",
        "src": "",
        "data": {
            "name": "The Illochu",
            "subtitle": "Ardu subgroup",
            "mainContent": "A subgroup of the ^[a Ardu Ardu]^  (this setting's Humans), the Illochu are wanderers through the Continent in the Ardu realms [a directionsPP Ad-Isto] of the Dwarven mountains."
        }
    },
    "directionsPP": {
        "type": "article",
        "src": "imgs/Directions.png",
        "data": {
            "name": "Directionality on the prime plane",
            "subtitle": "There's six!",
            "mainContent": "The Prime plane uses a system of directional notation based on the four elemental planes, the edge of the Plane and the center of the Plane. Each elemental plane which feeds into the Prime Plane along one of its axes. Thus the four cardinal directions are\n            _Ad-Krin_ (Plane of Fire)\n            _Ad-Eshu_ (Plane of Water)\n            _Ad-Rune_ (Plane of Earth)\n            _Ad-Sus_ (Plane of Air)\n            The directions _Ad-Sha_ (towards the rim) and _Ad-Krin_ (towards the center) are also used for contextual purposes.\n            The directions are named using _Ad_, the [a Varlossik Varlossik] term for \"Way\", and the terms for Fire, Wave, Earth, Wind, Center and Ending.\n            \"\"\"ahsdioa"
        }
    },
    "exampleCampaign": {
        "type": "article",
        "src": "",
        "data": {
            "name": "Super Fun Campaign",
            "subtitle": "wow!",
            "mainContent": "*Welcome to the Campaign!\n            [h 1 1: Stuff]\n            asdasdasd\n            asdas\n            [j 2 Fight the Thing]\n            a\n            a\n            a\n            a\n            a\n            aa\n            a\n            a\n            a\n            a\n            a\n            a\n            a\n            a\n\n            aa\n            a\n            a\n\n            a\n            a\n            a\n            a\n            a\n            a\n            a\n            a\n            a\n            a\n            [h 2 2: Fight The Thing]\n            "
        }
    },
    "Aradielgnome": {
        "type": "character",
        "src": "",
        "data": {
            "name": "Aradiel Riverstone",
            "race": "Forest Gnome",
            "class": "Ranger",
            "description": "Raised in the [a OroudanForest Oroudan Forest], Aradiel was abandoned by her parents at a young age after forsaking their gnomish craftings in exchange for a life of Adventure. She befriended a band of the ^[a ArduSubgroupsIllochu Illochu]^, who taught her the ways of the Wilds."
        }
    },
    "LPSMHelm": {
        "type": "item",
        "src": "",
        "data": {
            "rarity": "uncommon",
            "name": "Helm of Lightly Pressed Sheet Metal",
            "type": "helmet",
            "description": "Made by only the finest dwarven armorsmiths, the ^Helm of Lightly Pressed Sheet Metal^ provides only a small (+1) bonus to AC. However, it provides its wearer with a +3 bonus to Intelligence and Wisdom saves, as well as resistance to psychic damage and immunity to unwanted uses of telepathy."
        }
    },
    "spiritSummonMinor": {
        "type": "spell",
        "data": {
            "name": "Summon Minor Spirit",
            "level": 3,
            "school": "conjuration (ritual)",
            "duration": "varies",
            "components": "V, S, M (A summoning focus and a small gemstone)",
            "range": "60 feet",
            "castingTime": "5 minutes",
            "description": "You summon a ^[a minorSpirits minor spirit]^ into an empty space in a 60 foot range around you by concentrating your summoning focus into the gemstone, creating a planar gate through which the spirit is drawn.\n            _Summoning focuses:_ \n            ^Guide Spirit:^ a small magnetized needle"
        }
    },
    "Guidespirit": {
        "type": "monster",
        "src": "",
        "data": {
            "name": "Guide Spirit",
            "alignment": "varies",
            "type": "spirit",
            "size": "small",
            "AC": "16",
            "HP": "2d10 (11)",
            "speed": "20ft., fly 40ft.",
            "STR": "10 (+0)",
            "DEX": "17 (+3)",
            "CON": "10 (+0)",
            "INT": "16 (+3)",
            "WIS": "16 (+3)",
            "CHA": "13 (+1)",
            "savingThrows": "",
            "conditionImmunities": "",
            "damageResistances": "",
            "damageImmunities": "",
            "skillMods": "Insight +5, Arcana +5",
            "senses": "Passive Perception 15",
            "languages": "",
            "CR": "1/8",
            "XP": 100,
            "actions": "^_Guide._^ A Guide Spirit will use its action to fly towards the location it acts as a guide to. It will take the path most optimized for those following it, unless it was specified to do otherwise by its summoner. While it cannot speak, it emits a faint telepathic signal (accompanied by whistling and chirp noises) indicating it is meant to guide an individual or group of individuals towards a goal.\n            ^_Hide._^ A Guide Spirit can use its action to cast ^Invisibility^ on itself if the group it has been sent to protect is in danger.",
            "modifiers": "",
            "description": "A ^Guide Spirit^ is a [a CreaturecategorySpirit spirit] summoned by a Magic-User in order to guide a person or group of people towards an object or goal. They can be summoned using [a spiritSummonMinor Summon Minor Spirit], with a small magnetized needle used as the ^summoning focus^. Though, as a sprit, an unsummoned Guide Spirit is not aligned, they will most often take the alignment of their summoner, though this represents the aims of their guidance more than their actions, as all guide spirits will act much the same; taking the ^guide^ action when possible, resting with their party when necessary and ^hiding^ in combat."
        }
    },
    "Worldweaver": {
        "type": "monster",
        "src": "",
        "data": {
            "name": "World Weaver",
            "alignment": "true chaotic",
            "type": "Celestial",
            "size": "Huge",
            "AC": "",
            "HP": "127 (15d12 + 30)",
            "speed": "20ft., burrow 20 ft., swim 10ft. ",
            "STR": "16 (+3)",
            "DEX": "4 (-3)",
            "CON": "15 (+2)",
            "INT": "15 (+2)",
            "WIS": "10 (+0)",
            "CHA": "8 (-1)",
            "Skillmods": "",
            "savingThrows": "",
            "conditionImmunities": "",
            "damageResistances": "",
            "damageImmunities": "",
            "senses": "blindsight 100ft., darkvision 100ft., tremorsense 50 ft., truesight 50 ft., passiver Perception 10",
            "languages": "All, telepathy 15 ft.",
            "CR": 8,
            "XP": 3900,
            "actions": "^_Flailing Smite._^ If reduced to 20 hit points or lower, gains the ability to smash its tendrils across the ground, knocking loose boulders from the ceiling (1d12 boulders falling from the ceiling over a 30ft radius centered on the Weaver). These boulders do not damage the World Weaver. Each deals 4d10 damage.\n            ^_Planar Node._^ (2 uses per battle) Casts ^Mordenkainen's Private Sanctum^ and ^Mirage Arcane^ to trap 1d2 creatures in what ^appears^ to be a different plane. This will entrap them until they complete a preset task, as set by the DM.",
            "modifiers": "^_Hit go bang._^ Tentacle hit. Go bang. 1d8 damage, 1d6 different attacks.",
            "description": "A ^World Weaver^ is a great celestial being, vast in size and laying its tendrils down seemingly endless miles of subterannean tunnels. After being summoned by an incantation or wriggling its way through a portal not its own, it gets to work. Teleporting to a Focal Point of high energy somewhere nearby its location, it begins to burrow, superimposing a network of rocky caves over its preexisting underground surroundings. In the junctions between these tunnels, and sometimes interspersed randomly throughout them, it lays \"eggs\": nodules of energy so potent that they form a small rift in the dimensional fabric of the universe itself. These are self contained, and are structured thusly:\n            A small nodule of energy, detectable by a glowing mist or forcefield, acts as the boundary for a sphere with a maximum radius of 30ft. This will most likely be found within a preexisting cave.\n            When this nodule is entered, the adventurers will be teleported into a part of a different plane of existence. They will only be allowed access to a limited part of this plane, however that space may be considerably larger than the one they entered from.\n            By either leaving the way they came or completing some set goal (as specified by the DM), the adventurers are able to leave this area. They cannot exit the enclosed area through _any other_ means."
        }
    },
    "Primeplane": {
        "type": "location",
        "src": "",
        "data": {
            "header": {
                "title": "The Prime Material Plane",
                "flavorText": "The center of it all",
                "img": "Map of the Plane",
                "viewBoxData": "0 0 508 406.4"
            },
            "location": "As told in [a layOfBeginnings the Lay of Beginnings], the [a conceptsStruggle struggle] between [a orderAndChaosSpirits the spirits of order and chaos] produces an endless flow of energy. This energy - _cool name for ittt_ -known variously as ^magic^ or ^soul^ energy spirals throughout the planes, coalescing into the many worlds which make up this universe. The largest coalescences are the elemental planes of ^water^, ^earth^, ^fire^, and ^air^, amidst which all the rest bob and float. Like duckies! _Cool name for the energy of the universe_ all meets, eventually, in the Prime Plane. It is said that in [a Ovnor Ovnor], the great Lake at the center of the world, there is an island where one can harness the energy of the universe.",
            "people": "",
            "about": "^Energy swirls from the outermost depths of the cosmos, drawn evermore towards the center of the Planes^. \n        Everything ends up here, eventually, in the center of the Planar Gyre.\n        This is a test: \n        this thing does 1d10 psychic damage",
            "adventureHooks": "On the Prime Plane, the possibilities are endless! For adventures, it is recommended to ",
            "places": "There are a great deal of locations on the Prime Plane, each with deep lore and a deeper history.\n        *1. Hinresoul\n        Floating City of the Wise. Find out more about it [a Hinresoul here]!",
            "info": "The Prime Plane of the Worldbarrow campaign setting was created by SkiesShaper.",
            "creatorName": "SkiesShaper",
            "POIs": [
                {
                    "ID": 1,
                    "x": 222,
                    "y": 195
                }
            ]
        }
    },
    "Hinresoul": {
        "type": "location",
        "src": "",
        "data": {
            "header": {
                "title": "Hinresoul",
                "flavorText": "floating city of the wise",
                "img": "Hinresoul",
                "viewBoxData": "0 0 530 530"
            },
            "location": "Hinresoul floats above the Mountain range of Ernos' folly, a forbidding series of high peaks which appear to have been thrust from the earth by some ancient and terrible explosion. Its islands are encased from the bottom with a whitish stone, curiously unlike any found for miles and miles from its location\n        It is held in place with a vast magical beam, thrust out of the crystal-encased soul of a long-defeated spirit in the mountains below it.\n        Directly to its north and east is Lake Ovnor, and ships from its small haven will primarily traverse the [a skyTrails sky-trails] down to one of that great lake's principal ports. Occasionally they will come from as far as the elven kingdoms in the far east, Mensch-Kaoul, or one of the warring kingdoms in the west.\n        Directly to the south of Hinresoul is a dense forest, which gives way to arid badlands within a few hundred miles. The [a greatMaw Great Maw] opens some three hundred miles to Hinresoul's south. To the west is the great river and the fertile, rocky lands which surround it.",
            "people": "Sorry, this page is currently empty :(",
            "about": "Hinresoul stands above the great mountains of Ernos' Folly, its islands held in place by a beam of energy thrust out of the crystal-encased soul of a spirit of death which was defeated in ancient times by a great hero. Its population is _small_, measuring just over 600 people. Of those 600 or so full-time residents, the vast majority are members of one of the three orders who hold court on these islands, founded in the wake of the defeat of the Great Spirit of Death which gave this town its power. They are:\n        *-The Smiths of the Three Suns\n        *-The Keepers of the knowledge of Ernos' Bane\n        *-The Order of the Gilded Sprout.\n        You will learn more about them as you explore this city. For now, all you need to know is that each is dedicated to creating powerful magical artifacts, and the export of those artifacts make up the majority of the city's economy.",
            "adventureHooks": "^You gaze above the prow of your sky-ship. Glimmering in the light of the setting sun is the fabled city of Hinresoul. The captain orders a slow, and you feel a sudden grounding as the keel hits water once more, but this time thousands of feet above the nearest land.^\n        Hinresoul is full of opportunity. Dare you take it?\n        *The Thieves of the Withering Wood\n        Hinresoul exports many magical artifacts. Weapons, potions, scrolls of powerful spells. Normally this is a peaceful, uninterrupted trade. After all, most of the major guilds of spellcasters rely on at least one thing or another produced in its breezy heights. As such, shipments are often protected by powerful runes and guarded by powerful warriors. Only a few days ago, however, right after the members of your party had arrived in Hinresoul, a shipment went missing. The protection-runes were tracked, and found to be projecting their location from a forest but some 50 miles away.\n        Your party members are among those who volunteered to retrieve the shipment.\n\n        -Reward: At least some magical items for each party member, appropriate for level.\n        -Recommended Starting Level: 2-4\n        -Projected end level: 4-6\n\n        *The Assailants of the Encased Soul\n        The vast majority of Hinresoul's magical power comes deep from within the earth, in the mountains below it. Long ago, a warrior named Enros, after whom these mountains are named, and his companions fought an ancient spirit of darkness. Though he did not survive, and the mountains themselves were reared up in the wake of the battle, the dark spirit was vanquished and its soul encased in a tomb of adamantine and diamond. It is stored in a heavily-protected cave-encrusted fortress, and it is said an ancient dragon even guards it within her clutch of eggs. However, a crafty undead warrior by the name of S'coom has carved out a fortification within this cave system, and is preparing to strike and shatter the encasement. In doing so, he could combine his own soul with that of the Dark One, or else cause Hinresoul itself to come crashing to the ground. \n        Your party members, having gained fame in both retrieving the treasure from the Withered Wood and other escapades, are commanded by Hinresoul's council of high elders to defeat S'coom.\n\n        -Reward: Exceedingly powerful artifacts from the treasuries of Hinresoul\n        -Recommended Starting Level: 8-10\n        -Projected end level: 11-14\n\n        *The Summoning of a New Age\n        The encased soul, after being saved by a brave group of adventurers nearly a decade ago, is now fading. You must re-summon a new spirit of evil and defeat it in order to preserve the balance of Magic on this plane\n\n        -Reward: Soul-bound blades and spell components (link eventually)\n        -Recommended Starting Level: 15\n        -Projected end level: 18\n\n        ",
            "places": "*-H1: The Great Library\n        This vast building towers up two high floors, and is filled with bookshelves in which are hidden the secrets of the realms. Many enchantments of old are stored within its deep catacombs, and the Keepers, an ancient order of wizards who have hidden the lore of these islands somewhere safe.\n        *-H2: Plaza\n        Standing tall above the wide courtyard of the library is the great statue of Ernos. His staff is raised tall above his head, and through it thrusts the beam of energy which keeps these islands aloft.\n        *-H3: The Central Haven of Hinresoul\n        Great many-masted flying wind-ships will majestically float in and out of Hinresoul through this port, ready to transport its magical wares across the worlds.\n        *-H4: The tower of the Creator\n        Inside of this tall tower lie many treasures of the architect of these islands, skyehspaer (ski-es-pair) the wise. It is surrounded by a garden of fragrant flowers and a shimmering pond in which it is said the future may be scried.\n        *-H5: The One-Forge of the Smiths of the three suns\n        There are but two things tethering Hinresoul to the Prime Plane. The first being, of course, the Great Beam. But the second is a constant, neverending flow of burning lava, drawn into the great forge which lies above it. This is a low, stone building with a roof of simple wood. But the bright sound of hammers rings always from the clerics working within, singing their songs of power and imbibing their weapons and tools with a magical glint.\n        *-H6: The pool of the eternal wing\n        Upon this lone island was discovered, long ago, the secret of flight.\n        *-H7: The Ethereal Gardens\n        Filled with endless arrays of magical herbs and mystical fruits with many varied powers that are studied by the Order of the Guilded Sprout. Faerie Dragons and other, stranger beings may be found flitting around them.\n        *-H8: The Temple of the Order of the Gilded Sprout\n        An open-air building of dark gray stone, the Temple is vast and filled with bubbling cauldrons, burning incense, and drying plants. Monks wander its columned great hall, brewing potions and dyeing elixirs vibrant hues.\n        *-H9: The Keepers' overlook\n        To a layman, this will appear to be but a broad balcony overlooking the Ethereal Gardens. However, an adept Keeper can cast [SPELL] to see anywhere on this plane from it.\n        *-H10: The bridges of Serenity\n        Traveling down through a scattering of small floating islets, carpeted in moss, is a series of wooden bridges, connecting the main island and Great Library to the Ethereal Gardens and Temple of the Order of the Gilded Sprout.",
            "info": "The Hinresoul region is the work of SkiesShaper",
            "creatorName": "SkiesShaper",
            "POIs": [
                {
                    "ID": 1,
                    "x": 290,
                    "y": 230
                },
                {
                    "ID": 2,
                    "x": 280,
                    "y": 300
                },
                {
                    "ID": 3,
                    "x": 400,
                    "y": 380
                },
                {
                    "ID": 4,
                    "x": 10,
                    "y": 480
                },
                {
                    "ID": 5,
                    "x": 62,
                    "y": 185
                },
                {
                    "ID": 6,
                    "x": 410,
                    "y": 150
                },
                {
                    "ID": 7,
                    "x": 280,
                    "y": 120
                },
                {
                    "ID": 8,
                    "x": 245,
                    "y": 40
                },
                {
                    "ID": 9,
                    "x": 290,
                    "y": 160
                },
                {
                    "ID": 10,
                    "x": 200,
                    "y": 175
                }
            ]
        }
    },
    "": {
        "type": "Monster",
        "src": "",
        "data": {
            "name": "",
            "AC": "",
            "HP": "",
            "alignment": "",
            "type": "",
            "size": "",
            "speed": "",
            "STR": "",
            "DEX": "",
            "CON": "",
            "INT": "",
            "WIS": "",
            "CHA": "",
            "savingThrows": "",
            "conditionImmunities": "",
            "damageResistances": "",
            "damageImmunities": "",
            "skillMods": "",
            "senses": "",
            "languages": "",
            "CR": "",
            "XP": "",
            "actions": "",
            "modifiers": "",
            "description": ""
        }
    }
}