[{"title":"23 July, 2024 (actual article)","id":"08-23-24b","article":"So! The Node.js application now works in a barebones sort of way for monsters and news articles. Next to add are the rest of the content types and styling the thing, because it would be nice if this looked nice. right now it looks as though there is no CSS, because there isn't! \nTo Do: \nAdd the rest of the types\nStyle it up\nTidy up server code, make it so you can't have repeats of IDs &c"},{"title":"23 July, 2024","id":"9-23-24","article":"I have been working really hard on the backend for this site and have contrived a cunning solution involving a node.js server and localhost:8000 page which allows for slightly-nicer posts to be written and submitted into the page, then commited to github. Barebones it seems to be working!\n"},{"title":"July 23, 2024","article":"8-23-24a","id":"I have been working really hard on the backend for this site and have contrived a cunning solution involving a node.js server and localhost:8000 page which allows for slightly-nicer posts to be written and submitted into the page, then commited to github. Barebones it seems to be working! This is a test of the news bits"},{"id":"07-21-24a","title":"July 21, 2024","article":"News articles are now JSON-based\n        You can now link images, as well as little headers that are jump-to-able for use in campaigns etc\n        Some style changes for mobile - let's see if they work well!\n        *To Do:\n        -Node App is now much higher priority. Most content is done.\n        -Using the current JS scripts is OK, but using JSON files would be better, so that WorldBarrow can be swapped over to any universe's content. (probably using some sort of config file, then fetch...?)\n        "},{"id":"07-20-24a","title":"July 20, 2024","article":"The main search bar is added and fully functional!\n        This is the only addition, along with an about/settings page.\n        *To Do:\n        Back buttons maybe\n        Everything else"},{"id":"07-12-24b","title":"July 12, 2024 (late night)","article":"All content page types are added. An NPC (a character with stats) can use the monster page I think.\n        Added several articles (some characters, some items, a monster...)\n        Added a way to make a list of all of the different articles, with both title and ID stored\n        *To Do\n        fix homepage, add search bar\n        Make pages look better on phones (currently a bit small with the text on non-location pages)\n        Make aforementioned Node stuff\n        Ability to link images in body text\n        Ability to link to different parts of the text (like from heading to heading, in a campaign)\n        Possible custom font for the runes?"},{"id":"07-12-24a","title":"July 12, 2024 (early morning)","article":"Monster pages now work :D\n        I added the Guide Spirit as a base model. I plan to add the World Weaver in the future (later today)\n        I added functionality so that dice notation (i.e. 1d6 or 1d8+10) is now replaced in most areas where it would be called for (where full markdown is permitted, and in certain statblock areas.) with a button that displays the die roll and the result. In a snazzy l'il popup too!\n        I added this blog!\n        Also added is Averia Serif Libre as a fun little font for where Lugrasimo don't work\n        links all now use 'content' instead of 'location' OR 'content' as a selector, which changed some backend code.\n        I added a more basic version of the markup Regex function to simply strip JSON of any potentially dangerous characters. With hope, this will make user-submitted stuff eventually viable.\n        *To do\n        Maybe make a little node/shell app to do this blogging thing\n        Implement NPC, Character, Phenomena, item, and General Description page types in the \"other\" category\n        The possibility of JSON import/export? Probably this would be mostly locally, but that would be nice. Just a little node/electron app for managing the content stuff.\n        I considered Firebase integration, and in any case some chat/etc functionality would be nice in the longer run :D\n        Oh yeah uh making the search bar search"}]